Tekla Open API Reference for Tekla Structures 2025
StringList Constructor (Int32)
 Creates a new string list instance with the given capacity.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StringList(
	int Capacity
)
Public Sub New (
	Capacity As Integer
)
Parameters
Capacity
Type: System.Int32
The capacity of the string list.
See Also
Reference
StringList Class
StringList Overload
Tekla.Structures.Drawing Namespace